yangzhengxxx/agv/stm32f4/User/run/run.c
#include "run.h"
#include "math.h"
#include "delay.h"
// #include "imu.h"
#include "stdio.h"

#include "bsp_can1.h"
#include "bsp_can2.h"
// #include "comnet.h"
#include "4g_comnet.h"
#include "timer.h"
// #include "stm32f4xx_it.h"

#include "stm32f4xx.h"
#include "bsp_debug_usart.h"
// #include "bsp_485.h"
#include "string.h"
#include "rs16_lidar.h"
#include "key.h"
#include "lidar.h"
// #include "gps.h"

#define PI 3.1415926
#define MaxPedalDepth 100
// 最大油门  40, 40/0.4=100
#define MaxRomotePedalDepth 200
// 最大遥控油门 80, 80/0.4=200
#define BasePedalDepth 16
// 基础油门
#define PedalDepthCof 8
// 油门系数，速度差乘油门系数=油门变化量
#define BaseSpeed 2
#define NearGoalLen 1000
// 接近目标距离
#define SafeSpeed 2 // 9-20  6km/h used Car 2, 3km/h used Car 3，Dakhin22.1.6改回2
// 安全车速 2km/h
#define NormalSpeed 4 // 9-22
// 正常车速 10km/h
#define TurnSpeed 2
// 转弯车速 3km/h
#define RampSpeed 2
// 爬坡车速 2km/h
#define ReverseSpeed 3
// 倒车车速 3km/h
#define SpeedCoefficient 1.8
// 速度系数，用于计算轮速，1号车MCU反馈有误差
#define CorDis1 10
// 纠偏距离，当车辆偏离准确位置达到CorDis1，开始纠偏，单位cm
#define CorDis2 80
// 纠偏距离，当车辆偏离准确位置达到CorDis2，开始最大转角纠偏
#define CorDis3 20
////纠偏距离，当车辆偏离准确位置达到CorDis3，开始纠偏
u8 MaxCorAng = 5;
// 最大纠偏角，单位度
#define FilterAngle 8
// 直线行驶滤波角度
#define CANDataReadNum 20
// CAN总线无信号故障计数值
#define SpeedCalCof 5.5
// 速度计算系数，通过轮速计算车辆下一时刻位置
u8 EndPointCorrection = 0;
// 路线终止条件，考虑调度系统延迟设立的提前量
#define Turndis 0 // 计算转弯半径减少cm
#define ReverseCorVal 10
// 倒车修偏计算基准值
#define ReverseCorAng 4
// 倒车修偏角
#define compensate_angle 0 // 4.6号2
// Turn补偿转角

// CanRxMsg RxMessage,*Rx;
////CAN 数据接收结构体

unsigned char task_status = 0, NextTaskStatus, task_line_status = 0, task_stack = 100, task_type, task_end = 0, task_turn_num = 0, TaskError; // increase task_line_status
// task_status 任务状态, 0-无任务, 1-直线任务, 2-转弯任务, 3-倒车, 4-停车
// 5-倒车转向, 6-, 7-停车等待固定时间, 8-EmengancyStop, 9-brake
// 10-waiting	//14-停车等待固定时间，始终用EHB
// task_line_status，0-平地，1-爬坡，2-重载爬坡，3-溜坡
// 6-平地节拍行驶状态，7-溜坡节拍行驶状态，8-爬坡节拍行驶状态，9-重载爬坡节拍行驶状态
// task_stack 任务堆栈，车辆异常时临时记录车辆任务状态, 100-堆栈为空时的值
// task_type 调度系统传输任务类型, 1-line, 2-arc
// task_end, 任务结束状态标识，0-结束, 1-执行中
// TaskError 判断是否有重复任务，0-无重复，1-重复

int turnCenterX, turnCenterY;
// 转弯圆心
	unsigned char QRR, GPSL;//2025
u8 Expect_speed=0;
int WaitingBeat = 0, WaitingNum = 0;
// 等待节拍计数器，等待数值

unsigned short turn_goal_angle, RemoteCount = 0;
// 转弯目标角度
// 遥控计数器
unsigned char TaskCount = 0, TaskTotal = 0,  waiting_sum = 0, ThrottleSize, DrivingSpeed, BaseThrottle = 10, ScaleThrottle, ThrottleGrade;
// TaskCount,任务计数器
// TaskTotal，任务总数
// now_task，当前任务数组
// wating_sum, 等待计数器
// 遥控状态下进空挡（即退出自动驾驶状态）标识，0-正常遥控，1-进空挡
// DrivingSpeed 行驶速度，由调度系统给出的预期速度
// BaseThrottle,基础油们	ScaleThrottle,比例系数	ThrottleGrade,油门等级

// unsigned char SelfTestResult=0;//,pcnum=0;
// 自检结果，0-未自检，1-正常, 2-发车位置错误, 3-控制错误

// unsigned char relaxDataOK = 0;
int relaxPoint[20][2];
// 释放点位置

unsigned char SelfTestResult = 0, openmcuflag = 1;
unsigned char SelfTestResultposition = 0;
unsigned char SelfTestResultlidar = 0;
// 自检结果，0-未自检，1-正常, 2-发车位置错误, 3-控制错误
//  openmcuflag:开机首次进入遥控标志

int car_x = 0, car_y = 0, car_angle = 0, goal_x, goal_y, radius, turn_id, goal_angle;
// car_x,car_y 和 car_angle 是车辆x、y坐标和角度
// goal_x and goal_y goal_angle是目标x、y坐标，目标方位角
// radius 车辆转弯半径
// turn_id 转弯类型标识，1-左转x+，2-左转x-，3-左转y+，4-左转y-，5-右转x+，6-右转x-，7-右转y+，8-右转y-
// radius 车辆目标角度
int Cal_x, Cal_y, now_x, now_y, pass_x = 0, pass_y = 0, pass_angle, now_angle, deta_X = 0, deta_Y = 0;
// Cal_x,Cal_y 轮速计算的x、y坐标
// now_x,now_y now_angle 当前x、y坐标，方位角?ppass_x,pass_y  pass_angle前一x、y坐标，方位角
int start_x, start_y, start_angle;
// start_x,start_y ,start_angle直线起点x、y坐标和车辆方位角

int CarAngleData[20], end_x, end_y, NowCarangle, CarAngleCorrect, BaseAngle, AngleVarient;
// CarAngleData，车辆方位角数据，用于进行基于GPS的惯导校准
// end_x,end_y,终点x、y坐标，用于进行基于GPS的惯导校准
// NowCarangle，当前车辆方位角，用于进行基于GPS的惯导校准
// CarAngleCorrect，车辆方位角校准值，用于进行基于GPS的惯导校准
// BaseAngle 基准角度，车间停车前惯导角度，AngleVarient，车间停车再起时惯导角度变化值
unsigned char CarAngleNum, LidarTestSwitch = 1, LidarTestSwitch1 = 1, AngleTrans, NowPosition, CameraTestSwitch; // 11-17
// CarAngleNum，车辆角度计数器，采集车辆方位角数据时使用
// AngleTrans停车角度记录和用于惯导校准，1-记录，2-惯导校准
// LidarTestSwitch, 前后激光雷达障碍处理状态
// LidarTestSwitch1,侧雷达障碍处理状态
// CameraTestSwitch  前相机障碍处理状态

//***********GPS定义
unsigned char GPSLoseCount;
// unsigned char GPS_qual,Headin_qual;
// float GPS_speed;
// 是否使用GPS定位标识，0，不使用，1-使用

//***********预瞄算法
int preview_point_x, preview_point_y;
// 预瞄点x、y坐标
int pass_goal_x, pass_goal_y;
// 预瞄算法：下一基准出发点，值为上一目标点
int Release_x, Release_y;
// 释放点坐标
u8 Release_flag = 1;

short cor_angle = 0;
// 直线纠偏角
unsigned char cor_count;
// 直线纠偏计数器

unsigned short turnradius;
// 转弯半径

unsigned char remote_control_status = 1, car_direct;
// remote_control_status, 0-程序控制状态,1-遥控状态
// car_direct,直线行驶方向，影响直线行驶终止判别 11-x轴正向,12- x 轴负向, 21- y 轴正向,22-y 轴负向

unsigned char line_start = 0, turn_start = 0, turn_num = 0; //
// line_start 直线开始标识，0-直线初始化，1-正常行驶，
// turn_start 转弯开始标识，0-转弯段，1-10-回正段
// turn_num 转向计数器
int line_count = 0, Reverse_count = 0, ReverTurn_count = 0;
// 直线计数器，正常行驶计数，节拍行驶累加速度;倒车计数器；倒车转弯计数器
unsigned char wheel_angle;
// 车轮转角，转弯时的转角
unsigned short a = 206, b = 6780;
// a ， b 计算转弯时转角的系数

// 体重系数
u8 HeavyThro = 0;  // 油门
u8 heavy_flag = 1; // 首次速度之后，记录体重油门标志位

int length;
// 距目标距离，用于提前减速
unsigned char BrakePressure;
// BrakePressure 刹车压力，EPBStopStatus停车状态，0-未拉EPB，1-拉起EPB，2-EPB异常（无法拉起，需使用EHB驻车）

// IO口无线充电与任务开关定义
u8 task_flag = 0;
u8 wirelesscharging_flag = 1;

// 故障码定义
unsigned char HeadingAngleError = 0, GPSError = 0, SOCError = 0, lidarLoss = 0, LidarError = 0, OutTolerance = 0; // 8-29
u8 lidar1LossNum = 0, lidar1Loss = 0, lidar1Error = 0;
uint16_t lidarLossNum = 0;
// HeadingAngleError, 车辆方位角异常标识，0-正常, 1-异常
// GPSError GPS故障标识 0-正常, 1-故障
// lidarLoss  激光雷达丢失标识，0-正常, 1-丢失
// lidarError 激光雷达故障标识，0-正常, 1-故障
// lidarLossNum, 激光雷达丢失计数器，达到一定数值则认为激光雷达故障
// SOCError 电量故障标识，0-正常, 1-故障
u8 Stop_OutTo_flag = 0; // 刹车超差标志位，防止刹车滑行导致超差

unsigned char CANError, EPBError, PositionError;
unsigned char MCU_errlevelcount;
unsigned char CameraObstacleNum = 0, CameraLossNum = 0, CameraError = 0; // 9-6
// CameraError 相机故障标识，0-正常, 1-故障
// CameraObstacleNum, 相机障碍计数器，达到一定数值则认为相机检到障碍

