yangzhengxxx/agv/stm32f4/User/run/run.c
unsigned char TyreStatus = 0;
// TyreStatus 胎压状态标识，0-正常，1-异常

unsigned char LidarObstacle = 0, LidarObstacle2 = 0, CameraObstacle = 0, LidarEndCondition = 0;
// LidarObstacle 激光雷达检测障碍标识，0-检测距离内无障碍，1-检测距离内有障碍
// CameraObstacle 相机检测障碍标识，0-检测距离内无障碍，1-检测距离内有障碍
// LidarEndCondition （预留）以激光雷达判定是否结束直线行驶标识，0-不使用，1-使用

unsigned char VehicleState = 0; //,PositionReadState=0;
// VehicleState, 车辆状态，0-静止, 1-直线, 2-转弯
// PositionReadState 位置读取状态，0-正常，1-异常（通常GPS坐标为零）
unsigned char epbcount = 0;
int imuruncnt = 0;	  // 惯导运行计数器
u8 lidardatalose = 0; // lidar数据丢失（迭代次数多，变慢了）

// canbuf used to storage the information of CAN instructions
unsigned char canbuf[8] = {0x0c, 0x00, 0x00, 0x00, 0x1E, 0x78, 0x00, 0x3e};
unsigned char epscanbuf[8] = {0x0A, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
unsigned char vcucanbuf[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
unsigned char vcurevcanbuf[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
unsigned char drvcanbuf[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
unsigned char drvrevcanbuf[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
unsigned char newehbcanbuf[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
uint8_t newEPSrecvcanbuf[8] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
int16_t newEPSreturn = 0;
// CAN数据缓存数组

unsigned char MCU1flag, MCU2flag, MCU3flag, EPSflag, EPBflag, EHBflag, EHB1flag;
unsigned char GPSflag, Lidarflag, Lidarflag1, GPS1flag, GPS1flag, BMSflag, Cameraflag, Tyreflag;
unsigned char ULtrasonicFlag = 0; // 11.19 南奔洋改动，增加超声波

// 各CAN信号标识位

// 各CAN信号缓存数组
uint8_t MCU1canbuf[8];
uint8_t MCU2canbuf[8];
uint8_t MCU3canbuf[8];
uint8_t EPScanbuf[8];
uint8_t EPBcanbuf[8];
uint8_t EPBcanbuf1[8]; // F系列车两个EPB
uint8_t EPBcanbuf2[8]; // F系列车两个EPB
uint8_t EHBcanbuf[8];
uint8_t EHB1canbuf[8];
uint8_t GPScanbuf[8];
uint8_t Lidarcanbuf1[8];
uint8_t GPS1canbuf[8];
uint8_t BMScanbuf[8];
uint8_t Cameracanbuf[8]; // 9-6
uint8_t Tyrecanbuf[8];	 // 9-19
uint8_t Feature_idbuf[8] = {0x0a, 0x0a, 0x0a, 0x0a, 0x0a, 0x0a, 0x0a, 0x0a};
uint8_t ULtracanbuf[8];	   // 1.24 南奔洋改，增加超声波can接收数据
uint8_t check_mcu_data[8]; // 1.18 李雨微改，检查mcu欠压状态
u8 remoteflag = 0, rengongflag = 0;
uint8_t Chargecanbuf[8]; // 2023.9.2南奔洋改
uint8_t lowercomputercanbuf[8];//2025
u8 Homestate;			 // 归位开关状态 	为1时充电枪处于归位状态；为0时充电枪处于未归位状态。
u8 DCGunConnectStatus;	 // 直流补电座状态，0未连接1已连接
u8 ACGunConnectStatus;	 // 交流
u8 remote_start_status;//遥控器打开状态0关闭1打开

u8 CDCU_MCU_GearAct;//实际档位
//u8 MCU_ErrLevel;//故障等级

u8 HVstopstate;		   // 高压急停开关 	为1时高压急停按钮按下，执行下高压操作；为0时高压急停按钮未按下，执行上高压操作。
u8 Chargestate = 2;	   // 充电状态     	0x01:充电中  0x02:空闲、离线、故障等非充电状态
u8 Chargunstate;	   // 充电枪状态  	0x01:插枪    0x02:拔枪
u8 ChargeToSelfstate;  // 给充电车自身充电  1：充电   0：未充电
u8 HighLowSpeedSwitch; // 高低速模式开关  0:低速  1：高速

//***********MCU1参数
unsigned char Accelerator_Pedal, Motor_Tro, Motor_Speed_Plus, Energy_Gear_Sig, Shift_Change, MCU1_Counter, MCU_Control_Model;
float VehicleSpeed;
// VehicleSpeed 车速, 单位 km/h
// unsigned char MCU1_Updata,MCU2_Updata,MCU3_Updata,EPS_Updata,EHB_Updata,EHB1_Updata,GPS_Updata,Lidar_Updata,GPS1_Updata,BMS_Updata;
// 各CAN信号更新成功标识

//***********MCU2参数
unsigned char GearStatus = 0, BrakeSigna, MotorWorkModule, MotorControlStatus, PowerLimitStatus, MasterDisconnectRequest, MotorDct, ReducePowerTip;
unsigned int MotorSpeed, TripMeter;
// GearStatus 挡位状态, 1-倒挡, 4-前进挡 ,其他是空挡

//***********MCU3参数
unsigned int Battery_Voltage, Motor_Current, Motor_Temprature, Motor_Control_Temprature;

//***********EPS参数******充电车
unsigned int Address, Motor_Speed, Resever, EPS_Counter;
int Expect_EPS_Angle = 0;
// Address 地址
// Motor_Speed 电机速度设定
// Expect_EPS_Angle 转向角度设定 -50-0左      0-50右
// Resever 预留
// EPS_Counter 计数器

//***********VCU参数******充电车-动力参数
unsigned char VCU_Move = 0, VCU_Back = 0, VCU_Hand = 0, VCU_Auto = 1, VCU_Stop = 0;
unsigned short VCU_Moto_Speed = 0, VCU_Moto_Add = 0, VCU_Moto_Loss = 0;
// VCU_Move 前进：1有效，0取消
// VCU_Back 后退：1有效，0取消
// VCU_Hand 手动模式：1有效，0取消
// VCU_Auto 自动模式：1有效，0取消
// VCU_Stop 制动：1有效，0取消
// VCU_Moto_Speed 行走电机目标转速 0-5000r
// VCU_Moto_Add 行走电机加速率 0-300   精度0.1
// VCU_Moto_Loss 行走电机减速率

//********NEW MCU参数
unsigned char Drv_CtrlMode = 0, Drv_TgtGear = 0;
unsigned short Drv_TgtPedpos = 0, MCU_ThrotAct = 0, Drv_TgtPedpos1 = 0;
unsigned int MCU_MtrSpd = 0;
// Drv_CtrlMode 模式选择0x0:Throttle Control 0x1:Speed Control 0x2: Reserved 0x3: Reserved
// Drv_TgtGear 挡位0：N   1：D   2：R
// Drv_TgtPedpos 目标油门 偏移量-100，最大255

//********NEWEHB参数
uint16_t newBrakePressureReq = 0;

//***********EPB参数
unsigned char EPB_Park_Lamp_State, EPB_Warning_Lamp_State, EPB_Switch_State, Brake_Lights_Request, Deceleration_Request_Status, EPB_System_Status, EPB_Control_Model;
unsigned char EPB1_System_Status, EPB2_System_Status, EPB_DTC; // 故障码
unsigned int Deceleration_Request, Deceleration_Request_Check;
// EPB_System_Status EPB状态，0-未拉起，1-已拉起，4-拉起中，2-释放中

//***********EHB参数
unsigned char EHB_Status, Parking_Brake_Request, Actual_Pressure, EHB_Fault_Level, Brake_Condition, Brake_Pedal_Travel, EHB_Fault_Level;

//***********EHB1参数
unsigned char Braking_Request_Warning, OilIsfc_Warning, Current_Sensor_Fault, NTC_Fault, EHB_Over_Temp_Warning, EHB_Power_Supply_Warning, Pedal_Travel_Sensor_Fault_Lv1, Pressure_Sensor_Fault, Pedal_Travel_Sensor_Fault_Lv2, EHB_Power_Supply_Fault, ECU_Power_Supply_Fault, Power_Driver_Fault, Motor_Fault, Can_BusOff;

//***********BMS参数
unsigned char Battery_Fault, SOC; // SOC 电量
unsigned int BatteryVoltage;

//***********ACU参数
unsigned char Expect_Gear, Auto_Drive_Mod_Sta;
unsigned char lastExpect_Gear;
unsigned char Left_signal_control = 0, Right_signal_control = 0;
unsigned char EPB_Park_Request, BrakePressureReq, Expect_Pedal_Depth, ACU_Fault_Code = 0;
unsigned short Expect_Steering_Angle;
unsigned char Reversing_light_control = 0, Horn_control = 0, Emergency_hazad_warning_control = 0, Braking_control = 0;
unsigned char Message_Counter_ACU = 0;
unsigned char MCU_errlevel = 0;
// Expect_Gear 期望挡位，
// EPB_Park_Request EPB请求
// BrakePressureReq EHB刹车压力
// Expect_Pedal_Depth 期望油门
// unsigned char car_Fault_Code=0;
unsigned char check_mcupressure;

