yangzhengxxx/agv/stm32f4/User/run/run.c
u8 key;
u8 carmode = 0;		// 1为遥控驾驶2为人工驾驶
u8 lastcarmode = 0; // 1为遥控驾驶2为人工驾驶







//五菱
u8 auto_start=1;//wuling1为开始0为关闭
int EPS_Angle = 0;//AGVEPS角度
int16_t AGVsetangle;//最终给底盘的角度
u8 counter_ACU;
u8 lifting_req = 0; // 举升电机请求：0=悬停，1=举升，2=下降
uint8_t emergency_release = 0;
uint8_t emergency_brake = 0;
uint8_t remotemodecanbuf[8];//2025 0驻车1遥控2自动
uint8_t AGV_VCU_canbuf[8];//AGV底盘反馈
uint8_t AGV_EPB_canbuf[8];//AGV epb状态反馈
uint8_t AGV_PAUSED_canbuf[8];//AGV epb状态反馈
uint8_t AGV_EPS_canbuf[8];//AGV EPS反馈
uint8_t AGV_EHB_canbuf[8];//AGV EHB反馈
u8 AGV_remote_status;//AGV遥控状态0驻车1遥控2自动
u8 AGV_pole_status;//AGV拨杆模式1遥控2自动3默认
float AGV_getVehicle;//AGV底盘反馈速度
u8 AGV_getGear;//agv底盘反馈档位
uint8_t DISPATCHING_STOP_SW=0;//急停标志位  AGV给控制板
uint8_t TASK_START=0;//启动标志位
uint8_t TASK_PAUSE =0;//暂停标志位
uint8_t selftestresult=0;
uint8_t FB_DISPATCHING_STOP_SW=0;//急停标志位   控制板返给AGV
uint8_t FB_TASK_START=0;//启动标志位
uint8_t FB_TASK_PAUSE =0;//暂停标志位
uint8_t TO_AGV_PSUSE_canbuf[8];//给AGV底盘反馈暂停和启动状态
u8 AGVtaskover=0;//单个编号任务完成标志1为完成，2为未完成
u8 newAGVtaskover=0;//任务几完成就为几
int16_t now_task[50][12];
static int8_t currentSpeed = 0;  //AGVs速度阶梯变化 范围：-128 ~ 127
const int8_t SPEED_STEP = 1;//AGV阶梯是2
uint8_t uart_tx_flag = 0;
uint8_t FB_IS_PAUSED;//暂停状态标志
int16_t AGV_BMS_canbuf[8];//AGVBMS反馈
int16_t AGV_soc;
uint8_t brushSig;     /* 电刷信号：0/1 */
uint8_t chargeState;  /* 充电状态：0/1 */
uint8_t overchargeState;  /* 请求结束充电0/1 */
u8 taskseq;
u8 AGVtaskovercount;
u8 AGVwait;//AGV是否需要在等待点等待，1为等待，0为继续走 20251204
uint16_t arrive_flag;//到达任务终点播报语音提示（除了充电点都被置1）2025921
uint8_t shield_flag;//屏蔽超声波雷达标志位0不处理1屏蔽2025921
void HomeTrans(void)
{
  AGV_remote_status=remotemodecanbuf[0]&0x07;//遥控模式状态
	AGV_pole_status=(remotemodecanbuf[0]>>3);//遥杆当前所处位置
	AGV_getVehicle = (float)((AGV_VCU_canbuf[4] << 8) + AGV_VCU_canbuf[5]) * 0.0071132;
	AGV_getGear = (AGV_VCU_canbuf[0] & 0x0F) >> 2;
	DISPATCHING_STOP_SW = (AGV_PAUSED_canbuf[1] >> 7) & 0x01; // 位15，最高位
  TASK_START = (AGV_PAUSED_canbuf[1] >> 5) & 0x01;          // 位13，次高位
  TASK_PAUSE = (AGV_PAUSED_canbuf[1] >> 6) & 0x01;          // 位14，第三高位   
	
	AGV_soc=((uint16_t)AGV_BMS_canbuf[4] << 8) | AGV_BMS_canbuf[5];//电量
	brushSig    = (AGV_BMS_canbuf[6] >> 0) & 0x01;//电刷状态
  chargeState = (AGV_BMS_canbuf[6] >> 1) & 0x01;//充电状态  
	FB_DISPATCHING_STOP_SW = DISPATCHING_STOP_SW;//返回给AGV
	FB_TASK_START = TASK_START;
	FB_TASK_PAUSE = TASK_PAUSE;
	
		// 根据 TASK_PAUSE / TASK_START 更新暂停标志
	if (FB_TASK_PAUSE == 1)//625
	{
			FB_IS_PAUSED = 1;
	}
	if (FB_TASK_START == 1)
	{
			FB_IS_PAUSED = 0;
	}
	printf("xin lu xian");
	printf("AGV_BMS_canbuf[4]: %d", AGV_BMS_canbuf[4]);
  printf("AGV_BMS_canbuf[5]: %d", AGV_BMS_canbuf[5]);
  printf("FB_IS_PAUSED=%d AGV_soc=%d  brushSig=%d chargeState=%d\r\n", FB_IS_PAUSED,AGV_soc,brushSig,chargeState);//调试用
  printf("AGV_remote_status=%d AGV_getVehicle=%f\r\n", AGV_remote_status,AGV_getVehicle);
  printf("auto_start=%d\r\n",auto_start);
//	printf("AGV_getVehicle=%f \r\n", AGV_getVehicle);
	
}
void ALLGPIO_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_Init(GPIOE, &GPIO_InitStructure);
	GPIO_SetBits(GPIOE, GPIO_Pin_1);
	printf("GPIO_PE high!\r\n");
}

// 初始化函数
void Init(void)
{
	Debug_USART1_Config();							// Printf
	delay_init(168);								// 初始化延时函数
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); // 设置系统中断优先级分组2
	KEY_Init();
	ALLGPIO_Init();
	delay_ms(100);

	/*初始化串口*/
	// Debug_USART2_Config(); //GPS
	// Debug_USART3_Config(); //Wifi
//	Debug_UART4_Config();  // Remote
	Debug_UART5_Config();  // Lidar//调度

	// printf("USART Init\r\n");

	/*初始化CAN*/
	CAN1_Config();
	CAN2_Config();
	// printf("CAN Init\r\n");


	delay_ms(1000);

	/* 初始化定时器 */
	TIM2_Int_Init(1679, 999);
	TIM_Cmd(TIM2, ENABLE); // 使能定时器
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

	TIM5_Int_Init(4199, 999);
	TIM_Cmd(TIM5, ENABLE); // 中断使能，开启中断发送CAN指令模式
	TIM_ITConfig(TIM5, TIM_IT_Update, ENABLE);

	TIM4_Int_Init(839, 999);

	// TIM3_Int_Init(2099, 999);
	// TIM_Cmd(TIM3, ENABLE); // 中断使能，开启中断发送CAN指令模式
	// TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

	VoidGear();

	//	BCMControl(11);
	delay_ms(1000);



	KEY_Init();
	//printf("Init finished");
	// TIM5_Int_Init(8399, 999);
}

// 变量初始化函数
//*******************************CAN 接收函数
// mCU1信号读取函数
// mCU2信号读取函数
// EPS信号读取函数
// 老EPB信号读取函数
// 五菱新EPB
void EPB12Trans(void)
{	      
	EPB_System_Status = AGV_EPB_canbuf[4] & 0x0F;
}

// EHB信号读取函数2025
// VCU信号读取函数
// VCU信号读取函数
// EHB1信号读取函数
// 喇叭控制函数
//*******************************CAN recieve funtion
//// CAN数据生成函数
//void CANCreate(void)//chenpuhe
//{
//	int Expect_EPS_Angle2 = 0;

//	if (carmode == 2)
//	{
//		canbuf[1] = 0x00;
//		canbuf[2] = 0x00;
//		canbuf[4] = 0x1E;
//		canbuf[5] = 0x78;
//		Auto_Drive_Mod_Sta = 0;
//		Expect_Gear = 0x07;
//		//		EPB_Park_Request=0x03;
//	}
//	else if (carmode == 1)
//	{
//		Auto_Drive_Mod_Sta = 1;
//		canbuf[1] = BrakePressureReq;
//		canbuf[2] = Expect_Pedal_Depth;
//		Expect_EPS_Angle2 = Expect_EPS_Angle * 10;
//		if (Expect_EPS_Angle2 > 450)
//			Expect_EPS_Angle2 = 450;
//		if (Expect_EPS_Angle2 < -450)
//			Expect_EPS_Angle2 = -450;

//		Expect_EPS_Angle2 = Expect_EPS_Angle2 * 10 + 7800;

//		canbuf[4] = Expect_EPS_Angle2 / 256;
//		canbuf[5] = Expect_EPS_Angle2 % 256;

//		if ((_channels[0] == 0) && (_channels[1] == 0) && (_channels[2] == 0) && (_channels[3] == 0)) // 遥控关闭或通讯消失
//		{
//			canbuf[1] = 0x00;
//			canbuf[2] = 0x00;
//			canbuf[4] = 0x1E;
//			canbuf[5] = 0x78;

//			Expect_Gear = 0x07;
//			//		EPB_Park_Request=0x03;
//			//		if(carmode==1)
//			//		{
//			if (EPB_System_Status == 0 && epbcount <= 3)
//			{
//				EPBControl();
//			}
//			if (EPB_System_Status == 1)
//			{
//				EPB_Park_Request = 0;
//				printf("remote mode loss EPBstatus  is apply\r\n");
//			}

//			//		}
//			printf("remote close send invalid value");
//		}
//	}

//	canbuf[0] = Expect_Gear + Auto_Drive_Mod_Sta * 8 + Left_signal_control * 16 + Right_signal_control * 32 + EPB_Park_Request * 64;
//	canbuf[3] = ACU_Fault_Code;
//	canbuf[6] = Message_Counter_ACU * 16 + Braking_control * 8 + Emergency_hazad_warning_control * 4 + Horn_control * 2 + Reversing_light_control;
//	canbuf[7] = canbuf[0] + canbuf[1] + canbuf[2] + canbuf[3] + canbuf[4] + canbuf[5] + canbuf[6];
//	Message_Counter_ACU = (Message_Counter_ACU + 1) % 4;
//}

