yangzhengxxx/agv/stm32f4/User/run/run.c
static inline int8_t i8_abs(int8_t x) {
    return (x < 0) ? -x : x;
}

// CAN数据生成函数2025
void CANCreate(void)//chenpuhe五菱
{
		if(FB_IS_PAUSED==1||task_status == 4||task_status == 0)//暂停
		{Expect_EPS_Angle=0;}
    EPS_Angle =Expect_EPS_Angle*10 ;
		if (EPS_Angle > 450)     EPS_Angle = 450;
		else if (EPS_Angle < -450)  EPS_Angle = -450;	
	  AGVsetangle=(EPS_Angle+450)/0.1;//角度
	
		if (Expect_speed > 50)     Expect_speed = 50;
	  int8_t targetSpeed = (int8_t)Expect_speed;//速度阶梯
    int8_t speedDiff = targetSpeed - currentSpeed;
	  if (i8_abs(speedDiff) > SPEED_STEP) 
		{
        currentSpeed += (speedDiff > 0 ? SPEED_STEP : -SPEED_STEP);
    } 
		else 
		{
        currentSpeed = targetSpeed;
    }
	  if (currentSpeed > 50)     currentSpeed = 50;//速度
		
		
if (taskseq == 101 || (taskseq >= 120 && taskseq <= 125))//20251216
//if (taskseq == 101 && taskseq == 120 && taskseq == 121 && taskseq == 122 && taskseq == 123 && taskseq == 124 && taskseq == 125)
{
    overchargeState = 1;
//    if (task_status == 3)//ZQY20260225
//    {
//        FB_IS_PAUSED = 0;
//    }
}
		else overchargeState=0;
	canbuf[0] = (Expect_Gear & 0x07) |
            ((auto_start & 0x01) << 3) |
            ((lifting_req & 0x03) << 4) |
            ((EPB_Park_Request & 0x03) << 6);
	canbuf[1] = BrakePressureReq;
	canbuf[2] = (uint8_t)currentSpeed;  // 使用处理后的速度值;
	canbuf[3] = 0xff; // ACU错误代码;
	canbuf[4] = AGVsetangle;
	canbuf[5] = AGVsetangle>> 8;
	canbuf[6] = ((++counter_ACU & 0x0F) << 4) |
                0 << 3 | overchargeState << 2 | 0;
	canbuf[7] = canbuf[0] + canbuf[1] + canbuf[2] + canbuf[3] + canbuf[4] + canbuf[5] + canbuf[6];
	
	if(SelfTestResult==1) selftestresult=1;
	if(SelfTestResult==2) selftestresult=2;
	TO_AGV_PSUSE_canbuf[1]=(FB_DISPATCHING_STOP_SW << 0)|(FB_TASK_START << 1)| (FB_TASK_PAUSE << 2)|(selftestresult << 3)|(LidarObstacle << 5)|(arrive_flag << 6)|(shield_flag <<7 );//发送给AGV暂停,自检，遇障状态,到站语音标志，是否屏蔽超声波雷达
	if (task_status == 2) // 转向灯
    {
        if (Expect_EPS_Angle < 0)
        {
            TO_AGV_PSUSE_canbuf[0] = 0x04; //             
        }
        else if (Expect_EPS_Angle > 0)
        {
            TO_AGV_PSUSE_canbuf[0] = 0x08; // Light_TurnRight在bit3，设置为1（0x08 = 00001000
        }
    }

    else if (task_status == 1) // 日行灯
    {
				TO_AGV_PSUSE_canbuf[0]= 0x20; // 左日行灯 (bit5)
				TO_AGV_PSUSE_canbuf[0]|= 0x40; // 右日行灯 (bit6)
    }
    else // 关闭所有灯
    {
        TO_AGV_PSUSE_canbuf[0]= 0; // 

    }

}


void usart5Create(void)//AGV五菱
{
//	if(taskseq==1&&AGVtaskover==1&&NowPosition!=4){AGVtaskover=0;printf("one");}
//	if(taskseq==2&&AGVtaskover==1&&NowPosition!=1){AGVtaskover=0;printf("two");}
//	if(taskseq==3&&AGVtaskover==1&&NowPosition!=2){AGVtaskover=0;printf("three");}
//	if(taskseq==4&&AGVtaskover==1&&NowPosition!=4){AGVtaskover=0;printf("four");}
	
	AGVupsendbuf[1]=taskseq;
	AGVupsendbuf[2]=newAGVtaskover;
	AGVupsendbuf[3]=task_status;
  AGVupsendbuf[4]=AGV_remote_status;
	AGVupsendbuf[5]=AGV_soc;
	AGVupsendbuf[6]=brushSig;
	AGVupsendbuf[7]=chargeState;
	AGVupsendbuf[8]=AGVupsendbuf[1]+AGVupsendbuf[2]+AGVupsendbuf[3]+AGVupsendbuf[4]+AGVupsendbuf[5]+AGVupsendbuf[6]+AGVupsendbuf[7];


}






// EPS_CAN数据生成函数******充电车
// VCU_CAN数据生成函数******充电车
// MCU_CAN数据生成函数******充电车
// 空挡状态函数
void VoidGear(void)
{
	printf("VoidGear mode\n");
	Expect_Gear = 0;;
	EPB_Park_Request = 0;
	BrakePressureReq = 0;
	Expect_speed=0;//2025
	Expect_EPS_Angle=0;

}

// 退出自动驾驶状态函数
// EHB控制函数
void EHBControl(unsigned char BrakePressure)
{

	printf("***************using EHB to stop car with input brake pressure\n");
	//	Expect_Gear = 0;

	BrakePressureReq = BrakePressure;
	//Expect_speed=0;

}

void EPBGetup(void)
{
	Expect_Gear = 0;
	EPB_Park_Request = 2;
	BrakePressureReq = 0;
	Expect_speed=0;//2025
	Expect_EPS_Angle=0xffff;
	printf("epbgetup");
}

// EPB控制函数
void EPBControl(void) // AGV拉起EPB
{
	unsigned char i = 0, j = 0, k = 0; // i,j,k;
	printf("***************using EPB to stop car,EPBcanbuf[0]=%x\r\n", EPBcanbuf[0]);
	epbcount = epbcount + 1;
	EPBGetup();


	for (i = 0; i < 50; i++)
	{
		delay_ms(20);
		EPB12Trans();
		printf("EPB_System_Status=%d EPB_Park_Request=%d BrakePressureReq=%d\n", EPB_System_Status, EPB_Park_Request, BrakePressureReq);
		if (EPB_System_Status == 1)
		{
			i = 50;
			epbcount = 0;
		}
	}
	if (EPB_System_Status == 1)
	{
		printf("\r\n*****EPB has getup success!\r\n");
		epbcount = 0;
	} // 0:释放  1：应用
	else if (EPB_System_Status == 4)
	{
		printf("\r\n*****EPB is being engaged!\r\n");

	} // 0:释放  1：应用
	else
	{
		printf("\r\n*****EPB can not getup!    ");

		for (k = 0; k < 50; k++)
		{
			EPB12Trans();
			if (EPB_System_Status == 0)
				k = 50;
			printf("EPB_System_Status=%d ", EPB_System_Status);
		}
	}
}

// AGVEPB控制函数1
void EPBControl1(void)
{
	unsigned char i = 0, j = 0; //,j;
	printf("***************relax EPB,EPBcanbuf[0]=%x\r\n", EPBcanbuf[0]);

	Expect_Gear = 0;;
	EPB_Park_Request = 1;
	BrakePressureReq = 0;


	for (i = 0; i < 50; i++)
	{
		delay_ms(10);
		EPB12Trans();
		if (EPB_System_Status == 0)
			i = 50;
		printf("EPB_System_Status=%d ", EPB_System_Status);
	}
	if (EPB_System_Status == 0)
	{
		printf("EPB has release success!\r\n");
	}
	else
	{
		printf("EPB can not release!!! ");
	}
}

// EPS控制函数
void EPSControl(void)
{
	printf(" Expect_EPS_Angle=%d #@*\n", Expect_EPS_Angle);

	BrakePressureReq = 0;
	CANCreate();

}

// 倒车控制函数
void ReverseControl(void)
{
	// unsigned char i;
	if (LidarObstacle == 1)
	{
		// Expect_Pedal_Depth = 0;
		// Expect_Steering_Angle = 0xffff;
//		Drv_TgtPedpos = 0;
		Expect_speed=0;//2025
		Expect_EPS_Angle = 0;
	}

	printf("Expect_Pedal_Depth=%d Expect_Steering_Angle=%d \n", Expect_Pedal_Depth, Expect_Steering_Angle);
	// Expect_Gear = 1;
	Auto_Drive_Mod_Sta = 1;
	EPB_Park_Request = 0;
	BrakePressureReq = 0;
	newBrakePressureReq = 0;
}

// 等待控制函数
//*************************************************************************************************************

// 计算两点方位角的函数
int CalTwoPiontAngle(int x1, int y1, int x2, int y2)
{
	int deta_x, deta_y, angle;
	// deta_x is x coordinate difference between current location and target location
	// deta_y is y coordinate difference between current location and target location

	deta_x = x2 - x1;
	deta_y = y2 - y1;
	if (deta_x != 0)
	{
		angle = 1800 * atan((float)deta_y / (float)deta_x) / PI;

