yangzhengxxx/agv/stm32f4/User/run/run.c
		if ((deta_x < 0) && (deta_y > 0))
			angle = 1800 + angle; // section 2
		if ((deta_x < 0) && (deta_y < 0))
			angle = 1800 + angle; // section 3
		if ((deta_x > 0) && (deta_y < 0))
			angle = 3600 + angle; // section 4
		printf("deta_x=%d deta_y=%d angle=%d  ", deta_x, deta_y, angle);
	}
	return angle;
}

// 转弯中心点计算
void TurnCenterCal(void)
{
	int angle, deta_x, deta_y;
	GetPosition();

	if (turn_id == 1 | turn_id == 5)
		angle = 0;
	if (turn_id == 2 | turn_id == 6)
		angle = 1800;
	if (turn_id == 3 | turn_id == 7)
		angle = 900;
	if (turn_id == 4 | turn_id == 8)
		angle = 2700;

	goal_x = car_x;
	goal_y = car_y;
	// turnCenterX = goal_x + (radius - 100) * cos(PI * angle / 1800);
	// turnCenterY = goal_y + (radius - 100) * sin(PI * angle / 1800);
	turnCenterX = goal_x + radius * cos(PI * angle / 1800);
	turnCenterY = goal_y + radius * sin(PI * angle / 1800);
	printf("$$radius=%d angle=%d turnCenterX=%d turnCenterY=%d ", radius, angle, turnCenterX, turnCenterY);
}

// 转弯时轮胎的期望转角计算
void TireDeflectionAngleCal(void) // 初始角度
{
	wheel_angle = b / (radius - a);
	// 修改添加倒车转弯的基础转角 LI
	if (task_status == 2)
	{
		// if (turn_id < 5)
		// 	BaseAngle = 0 - wheel_angle - compensate_angle;
		BaseAngle = turn_id < 5 ? -wheel_angle : wheel_angle;
	}
	else if (task_status == 5)
	{
		BaseAngle = turn_id < 5 ? wheel_angle : -wheel_angle;
	}
	printf("  **BaseAngle=%d**\n", BaseAngle);
	// Expect_Steering_Angle = BaseAngle; // 12.18加Dakhin
}

// 计算与转弯中心点的距离
int DistanceCenterCal(int x, int y, int xc, int yc)
{
	int Len;
	Len = sqrt((x - xc) * (x - xc) + (y - yc) * (y - yc));
	printf(" ##distance of turn center, Len=%d ", Len);
	return Len;
}

// 车辆位置读取 激光雷达位置
void GetPosition(void)
{
	int detax, detay;
	int Doublesum;
	int maxDoublesum;

	// 读取当前位置前，记录前次位置信息

	pass_x = car_x;
	pass_y = car_y;
	pass_angle = car_angle;

	LidarData_Deal(); // LidarS数据读取
	car_x = rslidar_x;
	car_y = rslidar_y;
	car_angle = Rs_Angle; // car_angle扩大10倍，应用于预瞄算法，11.29 Dakhin

	if (pass_x == car_x && pass_y == car_y && task_status == 1 && line_start == 1)
	{
		lidardatalose++;
		if(AGV_getVehicle==0)//
			lidardatalose=0;
		printf("lidardatalose cnt=%d\n", lidardatalose);
		if (lidardatalose >= 30)//原来是10AGV改为30
			lidarlossStop = 1; // 多次收不到数据
	}
	else
	{
		lidarlossStop = 0;
		lidardatalose = 0;
	}

	detax = car_x - pass_x;
	detay = car_y - pass_y;
	Doublesum = detax * detax + detay * detay; // 超差

	if (Stop_OutTo_flag == 0 && AGV_getVehicle != 0)
	{
		if (lidardatalose > 1 ||task_status == 2)
			maxDoublesum = 40000;
		else
			maxDoublesum = 20000;

		if (Doublesum > maxDoublesum)
		{
			matchingcnt++;
			printf("matchingcnt=%d!!! car_x=%d,car_y=%d,pass_x=%d,pass_y=%d,Doublesum=%d\r\n", matchingcnt, car_x, car_y, pass_x, pass_y, Doublesum);
			CoordinateComple(car_direct);
			if (matchingcnt > 2)
				MatchingLoss = 1; // 多次超差标志
		}
		else
		{
			MatchingLoss = 0;
			matchingcnt = 0;
		}
		if (Doublesum > maxDoublesum && MatchingLoss == 1)
		{
			OutTolerance = 1;
			printf("OutTolerance=%d,pass_x=%d,pass_y=%d,car_x=%d,car_y=%d,Doublesum=%d, max=%d\r\n", OutTolerance, pass_x, pass_y, car_x, car_y, Doublesum, maxDoublesum);
			Stop();

			auto_start=0;//超差关自动驾驶
		}
		else
			OutTolerance = 0;
	}
	else
	{
		OutTolerance = 0;
		Stop_OutTo_flag = 0;
	}
}

void CoordinateComple(u8 car_direct)
{
	switch (car_direct)
	{
	case 11:
		car_x = pass_x + 20;
		car_y = pass_y;
		break;
	case 12:
		car_x = pass_x - 20;
		car_y = pass_y;
		break;
	case 21:
		car_x = pass_x;
		car_y = pass_y + 20;
		break;
	case 22:
		car_x = pass_x;
		car_y = pass_y - 20;
		break;
	}
	printf("NEW: car_direct=%d  car_x=%d  car_y=%d\r\n", car_direct, car_x, car_y);
}

// AGV车辆出发位置检测2025
int StartPositionTest(void)
{
	const int32_t relaxPoint[8][2] = {
    {  113, -81 },//充电桩
		{ -449, -994},//上料缓冲
		{ 4453, 1582},//2-1
		{ 4467, 605},//2-2
		{ 4467, -154},//2-3
		{ 4481, -1060},//2-4
		{ 4483, -1701},//2-5
		{ 4493, -2225},//2-6
};
	int outloerat2 = 0;
	unsigned char j, SPTR;
	// SPTR 位置检测结果，2-无法匹配初始位置，1-匹配初始位置成功
	u8 Release_Test_flag = 1;
	GetPosition(); // 获取车辆Lidar位置
	printf("***NOW car_x=%d  car_y=%d\r\n", car_x, car_y);
	NowPosition = 0;
	for (j = 0; j < 8; j++)
	{
		if (car_x != 0 || car_y != 0)
		{
			if (relaxPoint[j][0] != 0 | relaxPoint[j][1] != 0)
			{
				outloerat2 = ((car_x - relaxPoint[j][0]) * (car_x - relaxPoint[j][0]) + (car_y - relaxPoint[j][1]) * (car_y - relaxPoint[j][1]));
				if (outloerat2 < 0)
					outloerat2 = -outloerat2;
				if (outloerat2 <= 40000)//AGV自检改为两米
				{
					NowPosition = j + 1;
					Release_x = relaxPoint[j][0];
					Release_y = relaxPoint[j][1];
					Release_flag = 1;//待改
					printf("NowPosition=%d   outloerat2=%d\r\n", NowPosition, outloerat2);
					printf("Release_x=%d  Release_y=%d\n", Release_x, Release_y);
//					UART5_SendArray(t8266sendbuf, 24);
					j = 8;
				}
			}
		}
		else
		{
			if (Release_Test_flag == 1)
			{
				printf("Lidar error ,no buf, please check!\r\n");
				Release_Test_flag = 0;
			}
			SPTR = 2;
		}
	}

	if (NowPosition == 0)
		SPTR = 2;
	else
		SPTR = 1;
	
	if (taskseq == 101 || (taskseq >= 120 && taskseq <= 125)) 
{ 
    // ?????1
    if(NowPosition != 1) { SelfTestResult = 0; SPTR = 0; printf("number error1 selftest again"); }
}
else if ((taskseq >= 102 && taskseq <= 107) || taskseq == 126) 
{ 
    // ?????2
    if(NowPosition != 2) { SelfTestResult = 0; SPTR = 0; printf("number error2 selftest again"); }
}
else if (taskseq == 108 || taskseq == 114 || (taskseq >= 127 && taskseq <= 131)) 
{ 
    // ?????3
    if(NowPosition != 3) { SelfTestResult = 0; SPTR = 0; printf("number error3 selftest again"); }
}
else if (taskseq == 109 || taskseq == 115 || (taskseq >= 132 && taskseq <= 135)) 
{ 
    // ?????4
    if(NowPosition != 4) { SelfTestResult = 0; SPTR = 0; printf("number error4 selftest again"); }
}
else if (taskseq == 110 || taskseq == 116 || (taskseq >= 136 && taskseq <= 138)) 
{ 
    // ?????5
    if(NowPosition != 5) { SelfTestResult = 0; SPTR = 0; printf("number error5 selftest again"); }
}
else if (taskseq == 111 || taskseq == 117 || taskseq == 139 || taskseq == 140) 
{ 
    // ?????6
    if(NowPosition != 6) { SelfTestResult = 0; SPTR = 0; printf("number error6 selftest again"); }
}
else if (taskseq == 112 || taskseq == 118 || taskseq == 141) 
{ 
    // ?????7
    if(NowPosition != 7) { SelfTestResult = 0; SPTR = 0; printf("number error7 selftest again"); }
}
else if (taskseq == 113 || taskseq == 119) 
{ 
    // ?????8
    if(NowPosition != 8) { SelfTestResult = 0; SPTR = 0; printf("number error8 selftest again"); }
}
	
	return SPTR;
}

// 自检结果处理
// 故障码处理函数
// 调度系统通迅函数
// 转弯任务数据处理，根据坐标计算转弯参数
// 停车任务，在停车完成后进入等待任务状态
void StopTask(void)
{
	LidarTestSwitch1 = 0; // 侧雷达不再检测
//	if (AGV_getVehicle >= 3)
//	{
//		Stop();
//		Expect_speed=0;//2025
//	}
//	else
//	{
		EHBControl(20);
		delay_ms(20);
		EHBControl(0);
		Expect_speed=0;//2025
		Expect_EPS_Angle=0;//2025819
		memset(cangpsbuf2, 0, sizeof cangpsbuf2); //清空数组  
		memset(now_task, 0, sizeof now_task);
		memset(pointbuf, 0, sizeof pointbuf);
		task_status = 0;//2025819改为0	
		Task_Count=0;
		SelfTestResult = 0;//任务切换要重新自检
		if (taskseq >= 101 && taskseq <= 141) {
    newAGVtaskover = taskseq;//20251205任务几完成就发几
}
		else {printf("taskseq error！！");newAGVtaskover=0;}
		printf("taskover  newAGVtaskover==%d!!!！！",newAGVtaskover);
//	}
	AGVtaskover=1;
	if (!((taskseq >= 114 && taskseq <= 119) || taskseq == 126)) {
    FB_IS_PAUSED = 1;
    printf("taskseq=%d ", taskseq);
    printf("taskover pause!!");
}
	GetPosition();
}

