yangzhengxxx/agv/stm32f4/User/run/run.c
// AGV获取任务参数2025
void GetTaskParameter(void)
{
	unsigned char turnid;
	unsigned short enddis;
	int passx, passy; // 上一目标点坐标

	if (TaskCount > TaskTotal + 1)
	{
		task_status = 0;
		Task_Count = 0;
		TaskTotal = 0;
		AGVtaskover=1;
		printf("Task end!!! TaskCount=%d  Task_Count=%d TaskTotal=%d\n", TaskCount, Task_Count, TaskTotal);
	}
	else
	{
		if (TaskCount == TaskTotal + 1)
		{
			task_status = 4;
			printf("Stop!!! TaskCount=%d Task_Count=%d TaskTotal=%d\n", TaskCount, Task_Count, TaskTotal);
		}
		else
		{
			task_type = now_task[TaskCount][0];
			DrivingSpeed = now_task[TaskCount][4]*1;
			if (task_type == 1)
			{
				LidarTestSwitch = 3;//待改

				passx = goal_x;
				passy = goal_y;
				pass_goal_x = goal_x;
				pass_goal_y = goal_y;
				goal_x = now_task[TaskCount][1];
				goal_y = now_task[TaskCount][2];

				goal_angle = CalTwoPiontAngle(passx, passy, goal_x, goal_y);


				printf("Get line task! TaskCount=%d TaskTotal=%d task_type=%d \n", TaskCount, TaskTotal, task_type);
				printf(" DrivingSpeed=%d goal_x=%d goal_y=%d goal_angle=%d pass_goal_x=%d pass_goal_y=%d\n", DrivingSpeed, goal_x, goal_y, goal_angle, pass_goal_x, pass_goal_y);
				LineTask(goal_x, goal_y, 0); // 大直线，平路，普通油门，激光雷达开，相机开
			}

			if (task_type == 2)
			{
				LidarTestSwitch = 4;//待改

				turnid = now_task[TaskCount][5];
				turnradius = now_task[TaskCount][7]*10;
				enddis = now_task[TaskCount][6]*10;

				printf("Get turn task! TaskCount=%d TaskTotal=%d task_type=%d \n", TaskCount, TaskTotal, task_type);
				printf("LidarTestSwitch=%d DrivingSpeed=%d turnid=%d  turnradius=%d enddis=%d \n", LidarTestSwitch, DrivingSpeed, turnid, turnradius, enddis);
				TurnTask(turnid, turnradius, enddis, 0); // 左转，普通油门，激光雷达开
			}
			if (task_type == 3)
			{

				passx = goal_x;
				passy = goal_y;
				pass_goal_x = goal_x;
				pass_goal_y = goal_y;
				goal_x = now_task[TaskCount][1];
				goal_y = now_task[TaskCount][2];

				LidarTestSwitch = 15;//待改

				printf("Get reverse task! TaskCount=%d TaskTotal=%d task_type=%d  \n", TaskCount, TaskTotal, task_type);
				printf("LidarTestSwitch=%d DrivingSpeed=%d goal_x=%d  goal_y=%d \n", LidarTestSwitch, DrivingSpeed, goal_x, goal_y);

				ReverseTask(goal_x, goal_y, 0); // 大直线，平路，普通油门，激光雷达开，相机开
			}
			if (task_type == 5)
			{
				LidarTestSwitch =15;//待改

				turnid = now_task[TaskCount][5];
				turnradius = now_task[TaskCount][7]*10;
				enddis = now_task[TaskCount][6]*10;
				printf("Get reverseturn task! TaskCount=%d TaskTotal=%d task_type=%d  LidarTestSwitch=%d turnid=%d  turnradius=%d enddis=%d DrivingSpeed=%d\n", TaskCount, TaskTotal, task_type, LidarTestSwitch, turnid, turnradius, enddis,DrivingSpeed);
				ReverseTurnTask(turnid, turnradius, enddis, 0); // 左转，普通油门，激光雷达开
			}
			if ((task_type != 1) && (task_type != 2) && (task_type != 3) && (task_type != 5)&& (task_type != 4))
			{
				printf("Task data error! TaskCount=%d Task_Count=%d task_type=%d \n", TaskCount, Task_Count, task_type);
				ehbstop();
				EHBControl(10);
				auto_start=0;//退出自动驾驶
			}
			if (task_type == 4)
			{
				task_status = 4;
			}
			
			if (TaskCount == TaskTotal)
			{
				DrivingSpeed=10;
				printf("finial task");
			}
			

		}
		TaskCount = TaskCount + 1;
		// printf("CurpointX=%d CurpointY=%d\n", CurpointX, CurpointY); //可能计算出错，很大，22.3.4 Dakhin
	}
}

// 从缓存中获取任务数据AGV
int GetTaskForBuf(void)
{
	unsigned char i, j, repeatTask; //,checkSum;
	for (j = 1; j <= 50; j++)
		for (i = 0; i < 12; i++)
			now_task[j][i] = 0;

	if (Task_Count == 0)
		Checksum_Error = 1; // 如果没有收到任务，返回1
	else
	{
		TaskTotal = Task_Count;
		Checksum_Error = 0;
		printf("TaskTotal=%d \n", TaskTotal);
		for (j = 1; j <= TaskTotal; j++)
		{
			for (i = 0; i < 12; i++)
			{
				now_task[j][i] = cangpsbuf2[j-1][i];//AGV
				printf("%d ", now_task[j][i]);
			}
			printf("\n ");
		}
	}

//	printf("Before repeat:***relax buf[1]=%d buf[2]=%d  buf[3]=%d  buf[4]=%d\r\n", release_canbuf[0][1], release_canbuf[0][2], release_canbuf[0][3], release_canbuf[0][4]);

//	// 检测是否有重复任务
//	for (j = 2; j <= TaskTotal; j++)
//	{
//		repeatTask = 1;
//		for (i = 0; i < 12; i++)
//		{
//			if (now_task[j][i] != now_task[j - 1][i])
//			{
//				repeatTask = 0;
//				i = 12;
//			}
//		}
//		printf("repeatTask=%d  ", repeatTask);
//		if (repeatTask == 1)
//		{
//			printf("Repeat task error!!!\r\n");
//			j = TaskTotal + 1;
//			Checksum_Error = 1;
//			PointNum = 1;
//			Task_Count = 0;
//			memset(cangpsbuf2, 0, sizeof cangpsbuf2); // 清空数组  11.12Dakhin add
//			memset(now_task, 0, sizeof now_task);
//			memset(pointbuf, 0, sizeof pointbuf);
//		}
//	}

//	printf("After Repeat:***relax buf[1]=%d buf[2]=%d  buf[3]=%d  buf[4]=%d\r\n", release_canbuf[0][1], release_canbuf[0][2], release_canbuf[0][3], release_canbuf[0][4]);

	if (Checksum_Error == 0)
	{

		memset(cangpsbuf2, 0, sizeof cangpsbuf2); // 清空数组  11.12Dakhin add
		
		TaskCount = 1;//任务从一开始
	}

	printf("After error=0:***relax buf[1]=%d buf[2]=%d  buf[3]=%d  buf[4]=%d\r\n", release_canbuf[0][1], release_canbuf[0][2], release_canbuf[0][3], release_canbuf[0][4]);
	
	printf("Checksum_Error=%d\r\n", Checksum_Error);
	return Checksum_Error;
}

// 停车，等待系统任务,0-获取系统任务失败，1-获取系统任务成功
// 驻车等待
// 在等待任务过程中，如果超时，需要立刻停车
// 获取释放点数据
// 与调度系统通信，以获释放点取数据
// 按下遥控接管键后，进入遥控接管模式
// 遥控行驶
// 倒车处理，是普通倒车还是固定长度倒车
int ReverseProcess(void)
{
	unsigned char GPSL = 1;
	// GPSL 行驶时GPS丢失状态，0-丢失，1-正常
	LidarTestSwitch1 = 0; // 侧雷达不再检测
	GetPosition();		  // 获取车辆GPS位置
	printf("car_x=%d  car_y=%d  car_angle=%d\r\n", car_x, car_y, car_angle);
	if ((task_line_status == 0) || (task_line_status == 1) || (task_line_status == 2) || (task_line_status == 3))
	{
		if (lidarlossStop == 1 || MatchingLoss == 1 || lidarLoss == 1) // lidar多次数据丢失，多次超差......202592
		{
			printf("lidarlossStop=%d  MatchingLoss=%d lidarLoss=%d\r\n", lidarlossStop, MatchingLoss, lidarLoss);

			if (AGV_getVehicle > 0)
				Stop();
			

			return GPSL;
		}
		if (OutTolerance == 0 && MatchingLoss == 0)
		    	GPSL = NewReverse(); // 普通倒车

	}
	else
	{
		printf("Error Reverse ");

		//Expect_speed=0;//2025
	}
	GPSL = 1;
	return GPSL;
}

// 转向处理AGV
int TurnProcess(void)
{
	unsigned char GPSL = 1;
	// GPSL 行驶时GPS丢失状态，0-丢失，1-正常
//	LidarTestSwitch1 = 2; // 侧雷达开启检测
	GetPosition();		  // 获取车辆lidar位置
	if ((LidarObstacle == 0)  && (OutTolerance == 0))
		{
				if (lidarlossStop == 1 || MatchingLoss == 1 || lidarLoss == 1) // lidar多次数据丢失，多次超差....202592
			{
				printf("lidarlossStop=%d  MatchingLoss=%d lidarLoss=%d\r\n", lidarlossStop, MatchingLoss, lidarLoss);

				if (AGV_getVehicle > 0)
					Stop();
			

				return GPSL;
			}
			GPSL = Turn(); // 普通转弯
		}
	else
	{
		printf("Error turn ");

		//Expect_speed=0;//2025
	}
	return GPSL;
}

