yangzhengxxx/agv/stm32f4/User/run/run.c
// 倒车转向处理
int ReverseTurnProcess(void)
{
	unsigned char GPSL = 1;
	// GPSL 行驶时GPS丢失状态，0-丢失，1-正常
	LidarTestSwitch1 = 0; // 侧雷达不再检测
	GetPosition();		  // 获取车辆GPS位置
	
	if ((task_line_status == 0) || (task_line_status == 1) || (task_line_status == 2) || (task_line_status == 3))
	{
		if (lidarlossStop == 1 || MatchingLoss == 1 || lidarLoss == 1) // lidar多次数据丢失，多次超差.....20259.2
		{
			printf("lidarlossStop=%d  MatchingLoss=%d  lidarLoss =%d\r\n", lidarlossStop, MatchingLoss, lidarLoss);

			if (AGV_getVehicle > 0)
				Stop();

			return GPSL;
		}
		if (OutTolerance == 0 && MatchingLoss == 0)
			GPSL = ReverseTurn(); // 倒车转向
	}
	else
	{
		printf("Error Reverse ");
//		Expect_Pedal_Depth = 0;
		Expect_speed=0;
	}
	// GPSL = 1;
	return GPSL;
}

// AGV直行处理，是普通直行还是固定长度直行
int LineProcess(void)
{
	unsigned char GPSL = 1;
	// GPSL 行驶时GPS丢失状态，0-丢失，1-正常
	LidarTestSwitch1 = 0; // 侧雷达不再检测
	if ((task_line_status == 0) || (task_line_status == 1) || (task_line_status == 2) || (task_line_status == 3))
	{
		if ((LidarObstacle == 0) &&  (OutTolerance == 0))
		{
			GetPosition();								// 获取车辆lidar位置 ，lidarlossStop
			printf("car_x=%d  car_y=%d  car_angle=%d\r\n", car_x, car_y, car_angle);
			if (lidarlossStop == 1 || MatchingLoss == 1 || lidarLoss == 1) // lidar多次数据丢失，多次超差....202592
			{
				printf("lidarlossStop=%d  MatchingLoss=%d lidarLoss=%d\r\n", lidarlossStop, MatchingLoss, lidarLoss);

				if (AGV_getVehicle > 0)
					Stop();
			

				return GPSL;
			}
			if (OutTolerance == 0 && MatchingLoss == 0)
				GPSL = Line(); // 普通直线行驶
		}
		else
		{
			printf("Error task_line_status %d", task_line_status);

			Expect_speed=0;
		}
	}
	return GPSL;
}

// 任务是否结束判别及处理
// 直行任务，x,y目标坐标，PD直行类型
//  Lk激光雷达开放标识,1-激光雷达开,2-激光雷达开（近距离）,3-激光雷达和相机开，4
//  ICK=1进行GPS惯导校准标识,=2是否y坐标特别处理标识
//  GB行驶节拍数，AT停车角度记录标识，BC惯导修正标识
void LineTask(int x, int y, unsigned char PD)
{
	task_status = 1;
	task_line_status = PD;
	goal_x = x;
	// The minimum unit of dispatching system is 0.1 meter, which needs to be converted to 0.01 meter
	goal_y = y;
	printf("goal_x=%d goal_y=%d \n", goal_x, goal_y);

	// 油门计算
	//  BaseThrottle = BasePedalDepth + ThrottleGrade * 4;
	//  ScaleThrottle = PedalDepthCof + ThrottleGrade * 2;
	//  ThrottleGrade = now_task[TaskCount][1] % 16;
	//  printf("ThrottleGrade=%d  ScaleThrottle=%d  BaseThrottle=%d\r\n", ThrottleGrade, ScaleThrottle, BaseThrottle);
	// 直线行驶状态参数和计数器置零
	line_start = 0;
	// line_count = 0;
	// VehicleState = 1;
	// waiting_sum=0;
	// task_end=1;
	printf("LineTask OK! ");
}

// 右转，普通油门，激光雷达开，相机开
void TurnTask(unsigned char id, int r, int enddis, unsigned char PD)
{
	task_status = 2;
	task_line_status = PD;
	turn_id = id;
	radius = r;

	TireDeflectionAngleCal(); // 转弯时轮胎的期望转角计算
	TurnCenterCal();		  // 计算转弯中心点坐标

	if (id == 1)
		goal_x = car_x + enddis;
	if (id == 2)
		goal_x = car_x - enddis;
	if (id == 3)
		goal_y = car_y + enddis;
	if (id == 4)
		goal_y = car_y - enddis;
	if (id == 5)
		goal_x = car_x + enddis;
	if (id == 6)
		goal_x = car_x - enddis;
	if (id == 7)
		goal_y = car_y + enddis;
	if (id == 8)
		goal_y = car_y - enddis;

	printf("Turn id=%d radius=%d goal_x=%d goal_y=%d \n", id, radius, goal_x, goal_y);

	// LidarTestSwitch=Lk;
	// CameraTestSwitch=2;//12-17
	turn_start = 0;
	// VehicleState = 2;
	waiting_sum = 0;
	// task_end=1;
}

// 倒车任务，x,y目标坐标，PD倒车类型
//  Lk后激光雷达开放标识,1-激光雷达开
//  ICK=1进行GPS惯导校准标识,=2是否y坐标特别处理标识
//  GB行驶节拍数，AT停车角度记录标识，BC惯导修正标识
void ReverseTask(int x, int y, unsigned char PD)
{
	task_status = 3;
	task_line_status = PD;
	goal_x = x;
	// The minimum unit of dispatching system is 0.1 meter, which needs to be converted to 0.01 meter
	goal_y = y;
	printf("goal_x=%d goal_y=%d \n", goal_x, goal_y);

	line_start = 0;
	// line_count = 0;
	// VehicleState = 1;
	waiting_sum = 0;
	// task_end=1;
	printf("ReverseTask OK! ");
}

void ReverseTurnTask(unsigned char id, int r, int enddis, unsigned char PD)
{
	task_status = 5;
	task_line_status = PD;
	turn_id = id;
	radius = r;
	TireDeflectionAngleCal(); // 转弯时轮胎的期望转角计算
	TurnCenterCal();		  // 计算转弯中心点坐标
	if (id == 1)
		goal_x = car_x + enddis;
	if (id == 2)
		goal_x = car_x - enddis;
	if (id == 3)
		goal_y = car_y + enddis;
	if (id == 4)
		goal_y = car_y - enddis;
	if (id == 5)
		goal_x = car_x + enddis;
	if (id == 6)
		goal_x = car_x - enddis;
	if (id == 7)
		goal_y = car_y + enddis;
	if (id == 8)
		goal_y = car_y - enddis;

	printf("ReverseTurn id=%d radius=%d goal_x=%d goal_y=%d \n", id, radius, goal_x, goal_y);

	// CameraTestSwitch=2;//12-17
	// VehicleState = 2;
	waiting_sum = 0;
	turn_start = 0;
	// task_end=1;
}
// 参数置零
// 刹车函数AGV2025
void Stop(void)
{
	unsigned char i;
	static u8 stop_flag = 1; // 只拉一次EPB

	Stop_OutTo_flag = 1;

	for (i = 0; i < 40; i++)
	{
		printf("Stop! AGV_getVehicle=%.1f\n", AGV_getVehicle);
		if (AGV_getVehicle > 0)
		{

			BrakePressure = 5 + i / 4;
			if (BrakePressure > 30)
				BrakePressure = 30;//3.14
			EHBControl(BrakePressure);
		}
		else
		{
			i = 40; // 11.8
		}

		delay_ms(15);
		stop_flag = 1;
	}

	VehicleState = 0;

	if (EPB_System_Status != 1 && stop_flag == 1)
	{
		printf("Meeting obstacle, using EPB!\r\n");
		EPBControl();
		stop_flag = 0;
	}
}

void ehbstop(void)//ZQY20251121
{
	int i;
//	for (i = 0; i < 1000; i++)
	for (i = 0; i < 80; i++)
	{
		HomeTrans();
		printf("Stop! AGV_getVehicle=%.1f\n", AGV_getVehicle);
		//if (AGV_getVehicle > 0)
		if (AGV_getVehicle != 0)
		{
			//BrakePressure = 20 + i / 4;
			BrakePressure = (20 + i) / 4;
			if (BrakePressure > 40)
				BrakePressure = 40;
			EHBControl(BrakePressure);
		}
		else
		{
			i = 80;
			//i = 1000;
		}


		delay_ms(10);
	}
	VehicleState = 0;
}

////紧急刹车函数
// EPB刹车函数
// 减速函数，减到goal_speed，EHB压力固定6
// 减速函数，减到goal_speed，EHB压力固定6
// 油门计算函数，根据task_line_status数值对应的行驶状态计算油门
// 计算当前期望方位角，即当前位置到预瞄点的角度
void CalNowAngle(void)
{
	int deta_x, deta_y;
	// deta_x x坐标差值，当前位置和预瞄点
	// deta_y y坐标差值，当前位置和预瞄点

	deta_x = preview_point_x - car_x;
	deta_y = preview_point_y - car_y;
	if (deta_x != 0)
	{
		now_angle = 1800 * atan((float)deta_y / (float)deta_x) / PI;

