yangzhengxxx/agv/stm32f4/User/run/run.c
		if ((deta_x < 0) && (deta_y >= 0))
			now_angle = 3600 + now_angle; //?2?? 21
		if ((deta_x < 0) && (deta_y < 0))
			now_angle = 3600 + now_angle; //?3??
		if ((deta_x > 0) && (deta_y < 0))
			now_angle = 1800 + now_angle; //?4??
		if ((deta_x > 0) && (deta_y >= 0))
			now_angle = 1800 + now_angle; //?1??
	}
	 printf("***deta_x=%d deta_y=%d now_angle=%d  \n", deta_x, deta_y, now_angle);
}

// 计算直行修偏角度
void SteerAngleCal(void)
{
	int offset_angle; // offset_angle 当前方位角和期望方位角的差值
	cor_angle = 0;

	if (task_status == 3 || task_status == 5) // 偏差角 = 方位角 - 当前角度
	{
		int RearHeadingAngle;
		if (car_angle >= 1800)
			RearHeadingAngle = car_angle - 1800;
		else
			RearHeadingAngle = car_angle + 1800;
		offset_angle = RearHeadingAngle - now_angle;
	}
	else
	{
		offset_angle = car_angle - now_angle; // 偏差角 = 方位角 - 当前角度
	}

	// 将偏差角处理在-180到180区间
	if (offset_angle > 1800)
		offset_angle = offset_angle - 3600;
	if (offset_angle < -1800)
		offset_angle = offset_angle + 3600;

	if ((offset_angle > 10000) || (offset_angle < -10000))
		offset_angle = 0;

	if (offset_angle > 200 || offset_angle < -200)
		MaxCorAng = 10;
	else
		MaxCorAng = 7;

	// 偏差角大于滤波角，修偏角度为正
	if (offset_angle > FilterAngle)
	{
		cor_angle = (offset_angle - FilterAngle) / 15;
		if (cor_angle > MaxCorAng)
			cor_angle = MaxCorAng;
	}
	// 偏差角小于负滤波角，修偏角度为负
	if (offset_angle < -FilterAngle)
	{
		cor_angle = (offset_angle + FilterAngle) / 15;
		if (cor_angle < -MaxCorAng)
			cor_angle = -MaxCorAng;
	}

	printf("offset_angle=%d cor_angle=%d\n", offset_angle, cor_angle);
}

void SteerIMUAngleCal(void)
{
	int offset_angle = 0;
	offset_angle = Rs_Angle - imuinit_angle;

	// 将偏差角处理在-180到180区间
	if (offset_angle > 1800)
		offset_angle = offset_angle - 3600;
	if (offset_angle < -1800)
		offset_angle = offset_angle + 3600;

	if ((offset_angle > 10000) || (offset_angle < -10000))
		offset_angle = 0;

	if (offset_angle > 200 || offset_angle < -200)
		MaxCorAng = 6;
	else
		MaxCorAng = 3;

	// 偏差角大于滤波角，修偏角度为正
	if (offset_angle > FilterAngle)
	{
		cor_angle = (offset_angle - FilterAngle) / 15;
		if (cor_angle > MaxCorAng)
			cor_angle = MaxCorAng;
	}
	// 偏差角小于负滤波角，修偏角度为负
	if (offset_angle < -FilterAngle)
	{
		cor_angle = (offset_angle + FilterAngle) / 15;
		if (cor_angle < -MaxCorAng)
			cor_angle = -MaxCorAng;
	}
	printf("IMU offset_angle=%d cor_angle=%d\n", offset_angle, cor_angle);
}

// 计算预瞄点
void PreviewPointCal(unsigned char car_direct)
{
	// 分别按终止条件为x轴正向、x轴负向、y轴正向、y轴负向计算
	if (car_direct == 11)
	{
		preview_point_x = rslidar_x + 200; // 9-16
		preview_point_y = start_y + (float)(goal_y - start_y) * (float)(preview_point_x - start_x) / (float)(goal_x - start_x);
	}
	if (car_direct == 12)
	{
		preview_point_x = rslidar_x - 200; // 9-16
		preview_point_y = start_y + (float)(goal_y - start_y) * (float)(preview_point_x - start_x) / (float)(goal_x - start_x);
	}
	if (car_direct == 21)
	{
		preview_point_y = rslidar_y + 200; // 9-16
		preview_point_x = start_x + (float)(goal_x - start_x) * (float)(preview_point_y - start_y) / (float)(goal_y - start_y);
	}
	if (car_direct == 22)
	{
		preview_point_y = rslidar_y - 200; // 9-16
		preview_point_x = start_x + (float)(goal_x - start_x) * (float)(preview_point_y - start_y) / (float)(goal_y - start_y);
	}
	 printf("***preview_point_x=%d preview_point_y=%d ", preview_point_x, preview_point_y);
}

// 行驶故障检测函数，0-故障，1-正常
// 以当前车辆位姿信息作为起点位置和角度AGV2025
void StartPositionAssignment(void) // 确定直线的出发点
{
	int start_offset = 0;
	u8 start_flag = 0;
	if (Release_flag == 1 && TaskCount == 2)
	{
//		start_x = Release_x;
//		start_y = Release_y;
		start_x =car_x;
		start_y =car_y;
		Release_flag = 0;
		start_flag = 1;
		printf("start_x =car_x start_y =car_y ");
	}
	else
	{
		start_offset = (pass_goal_x - car_x) * (pass_goal_x - car_x) + (pass_goal_y - car_y) * (pass_goal_y - car_y);
		if (start_offset < 6000)
		{
			start_x = pass_goal_x;
			start_y = pass_goal_y;
			start_flag = 2;
		}
		else
		{
			start_x = car_x;
			start_y = car_y;
			start_flag = 3;
		}
	}
	start_angle = car_angle;

	printf("*start_x=%d start_y=%d start_flag=%d start_offset=%d\n", start_x, start_y, start_flag, start_offset);
}

// 发出空的EPS控制指令，防止车辆不确定运动
void ZeroEPSControlCode(void)
{

	Expect_EPS_Angle = 0;
	EPSControl();
}

// 行驶声音和部分设备检测,TT-任务类型，1直行，2转向
// 根据终止条件判别是否结束直行
void EndLineJudge(int length)
{
	u8 region = 30;
	static u8 flag = 1;
	if (length < 160000 && flag == 1)
	{
			EndPointCorrection = 5; // 刹车提前量

		flag = 0;
	}
	else
	{
		EndPointCorrection = 0;
		flag = 1;
	}

	if ((car_direct == 11) && (car_x >= goal_x - EndPointCorrection) && (car_y < goal_y + region | car_y > goal_y - region))
	{
		// task_status=0;
		task_status = 9;
		line_start = 0;
		arrive = 1;
		// task_end=0;
	}
	if ((car_direct == 12) && (car_x <= goal_x + EndPointCorrection) && (car_y < goal_y + region | car_y > goal_y - region))
	{
		// task_status=0;
		task_status = 9;
		line_start = 0;
		arrive = 1;
		// task_end=0;
	}
	if ((car_direct == 21) && (car_y >= goal_y - EndPointCorrection) && (car_x > goal_x - region | car_x < goal_x + region))
	{
		// task_status=0;
		task_status = 9;
		line_start = 0;
		arrive = 1;
		// task_end=0;
	}
	if ((car_direct == 22) && (car_y <= goal_y + EndPointCorrection) && (car_x > goal_x - region | car_x < goal_x + region))
	{
		// task_status=0;
		task_status = 9;
		line_start = 0;
		arrive = 1;
		// task_end=0;
	}
}

void EndIMUJudge(void)
{
	imuruncnt++;
	if (imuruncnt >= imucnt)
	{
		Stop();
		remote_control_status = 1;
		//		BCMControl(21); // 声音“遥控”
		printf("IMU have arrive, but lidar matching lose!\r\n");
	}
}

// AGV直行函数
int Line(void)
{
	unsigned char i, DriveFault = 1;
	// int ExpectSpeed;
	static u8 tim = 0;
	// DriveFault 行驶故障，0-故障，1-正常，包括：GPS丢失、激光雷达故障、相机故障等
	// printf("task line line_count=%d goal_x=%d goal_y=%d\r\n", line_count, goal_x, goal_y);
	// line_start=0，直行初始化

	if (line_start == 0)//AGV获取任务参数后就是0
	{
		StartPositionAssignment(); // 获取起点位置和角度     AGV可以

		car_direct = EndTaskConditions(); // 计算终止条件,得到 car_direct  重要！！！  AGV可以

		Expect_EPS_Angle = 0; // 初始给0度

		line_start = 1;
		if (VehicleState != 1)//AGV好像没用
			line_count = 1;
	}

	// 当line_start=1，开始直行
	else
	{

		HomeTrans();//AGV
		if (EPB_System_Status == 1)
		{
			epbcount = 0;
			EPBControl1();
		} // 如果EPB拉起，释放EPB
		length = (car_x - goal_x) * (car_x - goal_x) + (car_y - goal_y) * (car_y - goal_y); // 计算离目标点的距离
		if (task_status == 3 || task_status == 5)
		Expect_Gear = 0x1; // 后退档
		else if (task_status == 1 || task_status == 2)
		Expect_Gear = 0x2; // 前进挡

