yangzhengxxx/agv/stm32f4/User/run/run.c
		if ((length < 40000) )
		{
			VehicleState = 1;
			printf("slow!!!!");
			Expect_speed=15;//2025即1.5公里每小时
			if(car_x<=200&&car_x>=-200&&car_y<=200&&car_y>=-200)//2025926
			{
			printf("slow  3!!");
			Expect_speed=3;
			//shield_flag=1;//2025921
			}
		}
		else
		{
			if (matchingcnt > 1 | lidardatalose > 10)//略微超差或者上个数据和下个数据一样
			{
				printf("##0chaocha  slow！！！: ");
       Expect_speed=20;//2025即1公里每小时
			}
			else
			{
				printf("##2: ");
				Expect_speed=20;//2025DrivingSpeedAGV
			}
		}

		VehicleState = 1; // 置车辆状态为1，直行状态

		if (imuflag == 0) //********lidar给坐标在走
		{
			imuruncnt = 0;
			PreviewPointCal(car_direct); // 预瞄点
			CalNowAngle();				 // 计算当前角度
			SteerAngleCal();			 // 计算偏差角=航向角-自身角  //AGV好像可以不用改
		}
		else //*******惯导给角度在走
		{
			SteerIMUAngleCal();
		}
		Yaw();		  // 计算期望车轮转角
		EPSControl(); // EPS指令//AGV好像可以不用改




		if (imuflag == 0)//此条件必成立
			EndLineJudge(length); // 根据终止条件判别是否结束直行
		else
			EndIMUJudge();
	}
	return DriveFault;
}

// 转弯结束判别
void EndTurnJudge(void)
{
	u8 pre_end_dis = 20;								   // 出弯点提前20cm
	if ((turn_id == 1) && (car_x >= goal_x - pre_end_dis)) // 左转x增加
	{
		turn_start = 1;
		printf("##1: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y - turnradius + 200);
	}
	if ((turn_id == 2) && (car_x <= goal_x + pre_end_dis)) // 左转X减小
	{
		turn_start = 1;
		printf("##2: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y + turnradius - 200);
	}
	if ((turn_id == 3) && (car_y >= goal_y - pre_end_dis)) // 左转y增加
	{
		turn_start = 1;
		printf("##3: outturn_x=%d  outturn_y=%d\r\n", goal_x + turnradius - 200, goal_y);
	}
	if ((turn_id == 4) && (car_y <= goal_y + pre_end_dis)) // 左转y减小
	{
		turn_start = 1;
		printf("##4: outturn_x=%d  outturn_y=%d\r\n", goal_x - turnradius + 200, goal_y);
	}
	if ((turn_id == 5) && (car_x >= goal_x - pre_end_dis))
	{
		turn_start = 1;
		printf("##5: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y + turnradius - 200);
	}
	if ((turn_id == 6) && (car_x <= goal_x + pre_end_dis))
	{
		turn_start = 1;
		printf("##6: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y - turnradius + 200);
	}
	if ((turn_id == 7) && (car_y >= goal_y - pre_end_dis))
	{
		turn_start = 1;
		printf("##7: outturn_x=%d  outturn_y=%d\r\n", goal_x - turnradius + 200, goal_y);
	}
	if ((turn_id == 8) && (car_y <= goal_y + pre_end_dis))
	{
		turn_start = 1;
		printf("##8: outturn_x=%d  outturn_y=%d\r\n", goal_x + turnradius - 200, goal_y);
	}
}

// 倒车转弯结束判别
// 转弯结束判别
void REndTurnJudge(void)
{
	u8 pre_end_dis = 0;									   // 出弯点提前20cm
	if ((turn_id == 1) && (car_x >= goal_x - pre_end_dis)) // 左转x增加
	{
		turn_start = 1;
		printf("##1: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y - turnradius + 200);
	}
	if ((turn_id == 2) && (car_x <= goal_x + pre_end_dis)) // 左转X减小
	{
		turn_start = 1;
		printf("##2: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y + turnradius - 200);
	}
	if ((turn_id == 3) && (car_y >= goal_y - pre_end_dis)) // 左转y增加
	{
		turn_start = 1;
		printf("##3: outturn_x=%d  outturn_y=%d\r\n", goal_x + turnradius - 200, goal_y);
	}
	if ((turn_id == 4) && (car_y <= goal_y + pre_end_dis)) // 左转y减小
	{
		turn_start = 1;
		printf("##4: outturn_x=%d  outturn_y=%d\r\n", goal_x - turnradius + 200, goal_y);
	}
	if ((turn_id == 5) && (car_x >= goal_x - pre_end_dis))
	{
		turn_start = 1;
		printf("##5: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y + turnradius - 200);
	}
	if ((turn_id == 6) && (car_x <= goal_x + pre_end_dis))
	{
		turn_start = 1;
		printf("##6: outturn_x=%d  outturn_y=%d\r\n", goal_x, goal_y - turnradius + 200);
	}
	if ((turn_id == 7) && (car_y >= goal_y - pre_end_dis))
	{
		turn_start = 1;
		printf("##7: outturn_x=%d  outturn_y=%d\r\n", goal_x - turnradius + 200, goal_y);
	}
	if ((turn_id == 8) && (car_y <= goal_y + pre_end_dis))
	{
		turn_start = 1;
		printf("##8: outturn_x=%d  outturn_y=%d\r\n", goal_x + turnradius - 200, goal_y);
	}
}

// 转弯车轮回正段,tt任务类型，1-转向，2-倒车转向
void SectinReturn(unsigned char TT)
{
	Expect_EPS_Angle = 0;

	//ThrottleCal(VehicleSpeed, 1);
	Expect_speed=10;
	
	if (TT == 1)
		EPSControl();
	if (TT == 2)
		ReverseControl();
	turn_start = turn_start + 1;
	if (turn_start > 5)
	{
		GetPosition();
		task_status = 9;
		turn_start = 0;
		arrive = 1;
		goal_x = car_x;
		goal_y = car_y;
		// task_end=0;
	}
}

// 计算转弯修正角度
void CorAngCal(int ExpRadius, int RealRadius)
{
	int CorAngC;
	if ((turn_id <= 4) && (turn_id >= 1))
	{
		if (task_status == 2)
		{
			CorAngC = -(RealRadius - ExpRadius) / 10;
		}
		else
		{

			CorAngC = (RealRadius - ExpRadius) / 10;
		}
	}
	if ((turn_id <= 8) && (turn_id >= 5))
	{
		if (task_status == 2)
		{
			CorAngC = (RealRadius - ExpRadius) / 10;
		}
		else
		{

			CorAngC = -(RealRadius - ExpRadius) / 10;
		}
	}

	if (CorAngC > 8)
		CorAngC = 8;
	if (CorAngC < -8)
		CorAngC = -8;

	Expect_EPS_Angle = BaseAngle + CorAngC; // 固定转角后开始修改

	if (Expect_EPS_Angle > 45)
		Expect_EPS_Angle = 45;
	if (Expect_EPS_Angle < -45)
		Expect_EPS_Angle = -45;
	printf("  CorAngC=%d  Expect_EPS_Angle=%d\r\n", CorAngC, Expect_EPS_Angle);
}

// 转弯
int Turn(void)
{
	unsigned char GPSLose = 1, i, DriveFault = 1;
	// GPSLose GPS丢失情况，0-丢失，1-正常
	int detaAngleTurn, PedalDepthCal, LenC, CorAng, ExpectSpeed; // 10-1
	 HomeTrans();
	if (turn_start == 0)//获取完就是0
	{
		EPB12Trans();
		VehicleState = 2;
		if (EPB_System_Status == 1)
			EPBControl1();

		LenC = DistanceCenterCal(car_x, car_y, turnCenterX, turnCenterY); // 到转弯中心距离

//		Expect_EPS_Angle = 0;
		printf("##0:Expect_EPS_Angle=%d\r\n", Expect_EPS_Angle);

		CorAngCal(radius, LenC); // 修正角度CorAngC

		printf("wheel_angle=%d Expect_EPS_Angle=%d turn_id=%d\r\n", wheel_angle, Expect_EPS_Angle, turn_id);


		printf("##2: ");
		if (task_status == 3 || task_status == 5)
		Expect_Gear = 0x1; // 后退档
	  else if (task_status == 1 || task_status == 2)
		Expect_Gear = 0x2; // 前进挡
		Expect_speed=DrivingSpeed;//2025DrivingSpeed单位为km/h
		EPSControl();


		EndTurnJudge(); // 转弯结束判别
	}

	//********Steering return section
	if ((turn_start > 0) && (turn_start < 11))
		SectinReturn(1); // 转弯车轮回正段

	return DriveFault;
}

// 倒车
// 倒车转弯
int ReverseTurn(void) // 8-26
{
	unsigned char DriveFault = 1;
	int ExpectSpeed = 0, LenC = 0;
   HomeTrans();
	// GPSLose GPS丢失情况，0-丢失，1-正常
	if (turn_start == 0)
	{
		EPB12Trans();
		if (EPB_System_Status == 1)
		{
			epbcount = 0;
			EPBControl1();
		}

		LenC = DistanceCenterCal(car_x, car_y, turnCenterX, turnCenterY); // 到转弯中心距离
		Expect_EPS_Angle = 0;
		VehicleState = 4;
		CorAngCal(radius, LenC); // 修正角度CorAngC
		printf("RETURN:wheel_angle=%d Expect_EPS_Angle=%d turn_id=%d\r\n", wheel_angle, Expect_EPS_Angle, turn_id);

		if (task_status == 3 || task_status == 5)
		 Expect_Gear = 0x1; // 后退档
		else if (task_status == 1 || task_status == 2)
		 Expect_Gear = 0x2; // 前进?
		Expect_speed=DrivingSpeed;
		ReverseControl();

		REndTurnJudge(); // 转弯结束判别
	}
	if ((turn_start > 0) && (turn_start < 11))
		SectinReturn(2); // 转弯车轮回正段
	return DriveFault;
}

// Calculate the heading from the current position to the target position
// 结束条件判别，11-x轴正向，12-x轴负向，21-y轴正向，22-y轴负向
int EndTaskConditions(void)
{

