yangzhengxxx/agv/stm32f4/User/run/run.c
	int deta_x, deta_y, redata;

	deta_x = goal_x - start_x;
	deta_y = goal_y - start_y;
	if (deta_x < 0)
		deta_x = -deta_x;
	if (deta_y < 0)
		deta_y = -deta_y;

	// printf("deta_x=%d  deta_y=%d\n",deta_x,deta_y);

	if (deta_x > deta_y)
	{
		if (goal_x - start_x >= 0)
			redata = 11;
		else
			redata = 12;
	}
	else
	{
		if (goal_y - start_y >= 0)
			redata = 21;
		else
			redata = 22;
	}
	printf("goal_x-start_x=%d goal_y-start_y=%d  car_direct=%d \n", goal_x - start_x, goal_y - start_y, redata);
	return redata;
}

// 从CAN读取MCU1数据
// 从CAN读取MCU2数据
// 从CAN读取Lidar数据
//void LidarRead(void)
//{
//	static u8 lidarreadcnt = 0;
//	// Lidar_Updata=0;
//	if (Lidarflag == 1)
//	{
//		LidarTrans();
//		lidarreadcnt++;
//		Lidarflag = 0;
//		lidarLossNum = 0; // 8-29
//		if (lidarreadcnt > 2)
//		{
//			if (lidarLoss == 1)
//				printf("##One line Lidar has recovery!\r\n");
//			lidarLoss = 0;
//		}
//	}
//	else if (LidarObstacle == 0)
//	{
//		lidarreadcnt = 0;
//		lidarLossNum++;
//		if (lidarLossNum > 30)
//		{
//			lidarLoss = 1;
//			//		  BCMControl(30);//F系列避障系统故障
//		}
//		else
//			lidarLoss = 0;
//		printf("lidarLossNum=%d  lidarLoss=%d  \r\n", lidarLossNum, lidarLoss);
//	}
//	if (lidarreadcnt > 100)
//		lidarreadcnt = 0;
//	if (lidarLossNum > 200)
//		lidarLossNum = 100;
//}

//void LidarRead(void)//新版
//{

//	if (USART5_RX_END == 1)
//	{
//		newLidarTrans();
//		
//	}
//  if (LidarObstacle == 0)
//	{
//	
//		lidarLossNum++;
//		if (lidarLossNum > 300)
//		{
//			lidarLoss = 1;
//			//		  BCMControl(30);//F系列避障系统故障
//		}
//		else
//			lidarLoss = 0;
//		printf("lidarLossNum=%d  lidarLoss=%d  \r\n", lidarLossNum, lidarLoss);
//	}

//	if (lidarLossNum > 400)
//		lidarLossNum = 100;
//}

void LidarRead(void) // 6.23版
{
//        newLidarTrans();
     newcanLidarTrans();
		if (Lidar_Status == 0)
		{
		  lidarLoss = 0;
			lidarLossNum=0;
		
		}
    else
    {
     
        //if (Lidarflag > 50)//202592
        //{
            lidarLoss = 1;     // MODIFIED: ??????,?????
        //}
        //else
        //{
          // lidarLoss = 0;     // MODIFIED: ????,?????
        //}
        printf("Lidar_Status=%d  lidarLoss=%d  \r\n", Lidar_Status, lidarLoss);
    }

    if (Lidarflag > 100)//2025926
    {
        lidarLoss = 1;
			Length_Obstacle=0;
			Length_Obstacle1=0;

			
			printf("Lidarflag=%d",Lidarflag);
    }

		
}



// 从CAN读取Lidar1数据
// 从CAN读取EHB数据
// 从CAN读取EPS数据
// 从CAN读取EPB数据
// 从CAN读取Camera数据
// Determine the steering according to the calculated deviation, 1-turn right, 2-turn left, 0-straight
// the function used to calculate the correction deviation angle
void Yaw(void)
{
if (task_status == 1)
{
	if (cor_angle > 0)
	{
		Expect_EPS_Angle = cor_angle * 2 + compensate_angle;
		printf("%%  right  cor_angle=%d %%", cor_angle);
	}
	else if (cor_angle < 0)
	{
		Expect_EPS_Angle = cor_angle * 2;
		printf("%%  left  cor_angle=%d %%", cor_angle);
	}
	else
	{
		Expect_EPS_Angle = compensate_angle;
	}
}
if (task_status == 3)
{
		if (cor_angle > 0)
	{
		Expect_EPS_Angle = -(cor_angle * 2 + compensate_angle);
		printf("%%  right  cor_angle=%d %%", cor_angle);
	}
	else if (cor_angle < 0)
	{
		Expect_EPS_Angle = -cor_angle * 2;
		printf("%%  left  cor_angle=%d %%", cor_angle);
	}
	else
	{
		Expect_EPS_Angle = 0;
	}
}
}

// the function used to calculate the correction deviation angle when reversing
// Remote turn funtion, 1-29 turn left, 31-60 turn right
// 激光雷达自检
void RevokeControl(void)
{
//if (remote_control_status == 0)//2025非遥控状态撤回订单才刹车
//	{
//		Stop();
//	}
	Taskokreset();
	Task_Count = 0;
	task_status = 0;  // 需要重新接收任务，当前任务类型
	TaskCount = 0;	  // 当前第几个任务
	TaskTotal = 0;	  // 任务总数
	task_flag = 0;	  // 任务开关

}

void Taskokreset(void)
{
	turn_num = 0;
	Reverse_count = 0;
	ReverTurn_count = 0;
	if (VehicleState != 1)
	{
		line_count = 0;
		heavy_flag = 1; // 重量油门标志位置
	}
}

void MCUSend(void)
{
	MCU_Control_Model = 2;
	MCU1_Counter = (MCU1_Counter + 1) % 4;
	MCU1canbuf[6] = MCU_Control_Model * 4 + MCU1_Counter * 16;
	MCU1canbuf[7] = MCU1canbuf[6];

	MotorControlStatus = 1;
	MCU2canbuf[0] = MotorControlStatus * 32;

	Can2_Send_Msg_Flag(0x0, 0x0CF008FB, canbuf, 8);
	//  Can2_Send_Msg_Flag(0x0, 0X18F900EF, MCU1canbuf, 8);
	//	Can2_Send_Msg_Flag(0x0, 0X18F560EF, MCU2canbuf, 8);
}

int16_t U1_distance, U2_distance, U3_distance, U4_distance;
int8_t ULtraObstacle;
int8_t firstObstacleFlag = 1;
int NewReverse(void)
{
	unsigned char DriveFault;
	HomeTrans();
	if (line_start == 0)
	{
		printf("task Reverse line_count=%d goal_x=%d goal_y=%d\n", line_count, goal_x, goal_y);
		StartPositionAssignment(); // 获取起点位置和角度
		car_direct = EndTaskConditions();
		ZeroEPSControlCode(); // 发出空的EPS控制指令，防止车辆不确定运动
		if (VehicleState != 3)
			Reverse_count = 1;
		DriveFault = 1;
		line_start = 1;
	}
	else
	{
		printf("Reverseing3");
		VehicleState = 3;

		if (EPB_System_Status == 1)
			EPBControl1();
		length = (car_x - goal_x) * (car_x - goal_x) + (car_y - goal_y) * (car_y - goal_y);
		if (task_status == 3 || task_status == 5)
		 Expect_Gear = 0x1; // 后退档
	  else if (task_status == 1 || task_status == 2)
		 Expect_Gear = 0x2; // 前进挡


		if (length < 40000)
		{
			printf("slow!!!!");
			Expect_speed=10;
		}
		else
			Expect_speed=DrivingSpeed;//2025DrivingSpeed单位为km/h
		printf("DrivingSpeed=%d",DrivingSpeed);
		PreviewPointCal(car_direct); // 预瞄点
		CalNowAngle();				 // 计算当前角度
		SteerAngleCal();			 // 计算偏差角=航向角-自身角


		if (cor_angle > 0)
		{
			Expect_EPS_Angle = -(cor_angle * 2 + compensate_angle);
			printf("%%  right  cor_angle=%d %%", cor_angle);
		}
		else if (cor_angle < 0)
		{
			Expect_EPS_Angle = -cor_angle * 2;
			printf("%%  left  cor_angle=%d %%", cor_angle);
		}
		else
		{
			Expect_EPS_Angle = 0;
		}
		EPSControl(); // EPS指令
		EndLineJudge(length);
	}
	return DriveFault;
}

